melair/ktane/Firmware/STM32/Comms/App/Src/BLE/app_ble.c
      /* USER CODE END EVT_LE_META_EVENT_1 */

      default:
        /* USER CODE BEGIN SUBEVENT_DEFAULT */

        /* USER CODE END SUBEVENT_DEFAULT */
        break;
      }
    } /* HCI_LE_META_EVT_CODE */
    break;

  case HCI_VENDOR_EVT_CODE:
    {
      aci_blecore_event *p_blecore_evt = (aci_blecore_event*) event_data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */

        /* USER CODE END ecode */
      case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
        {
          aci_l2cap_connection_update_resp_event_rp0 *p_l2cap_conn_update_resp = (aci_l2cap_connection_update_resp_event_rp0
            *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_resp);
          /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_RESP */

          /* USER CODE END EVT_L2CAP_CONNECTION_UPDATE_RESP */
        }
        break;
      case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE\n");
          aci_gap_proc_complete_event_rp0 *p_gap_proc_complete = (aci_gap_proc_complete_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_gap_proc_complete);

          /* USER CODE BEGIN EVT_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_GAP_PROCEDURE_COMPLETE */
        }
        break;
      case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
        /* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/

        /* USER CODE END RADIO_ACTIVITY_EVENT*/
        break;
      case ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          /* USER CODE BEGIN ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_PASSKEY_REQ_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PASSKEY_REQ_VSEVT_CODE\n");

          aci_gap_passkey_req_event_rp0 *p_passkey_req = (aci_gap_passkey_req_event_rp0 *)p_blecore_evt->data;
          APP_DBG_MSG("     - Connection Handle: 0x%04X\n", p_passkey_req->Connection_Handle);
          uint32_t pin;
          ret = select_pairing_pin(p_passkey_req->Connection_Handle, &pin);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("Pairing PIN selection failed: 0x%02X\n", ret);
            ret = APP_BLE_Disconnect(p_passkey_req->Connection_Handle);
            if (ret == BLE_STATUS_UNKNOWN_CONNECTION_ID)
            {
              /* Reject an unexpected stack link that has no application record. */
              ret = aci_gap_terminate(p_passkey_req->Connection_Handle, BLE_ERROR_TERMINATED_REMOTE_USER);
            }
            if (ret != BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("Pairing connection termination failed: 0x%02X\n", ret);
            }
            break;
          }
          ret = aci_gap_passkey_resp(p_passkey_req->Connection_Handle, pin);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Success\n");
          }
          /* USER CODE BEGIN ACI_GAP_PASSKEY_REQ_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PASSKEY_REQ_VSEVT_CODE*/
        }
        break;
      case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          aci_gap_pairing_complete_event_rp0 *p_pairing_complete = (aci_gap_pairing_complete_event_rp0 *) p_blecore_evt->data;

          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Connection Handle: 0x%04X\n     - Pairing KO\n"
                        "     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                        p_pairing_complete->Connection_Handle,
                        p_pairing_complete->Status, p_pairing_complete->Reason);
            if ((p_pairing_complete->Status == SM_PAIRING_FAILED) &&
                (p_pairing_complete->Reason == AUTH_REQ_CANNOT_BE_MET))
            {
              APP_DBG_MSG("     - Authentication requirements cannot be met; check peer/local "
                          "IO capabilities, MITM and Secure Connections negotiation\n");
            }
          }
          else
          {
            uint8_t security_mode;
            uint8_t security_level;

            APP_DBG_MSG("     - Connection Handle: 0x%04X\n     - Pairing Success\n",
                        p_pairing_complete->Connection_Handle);
            ret = aci_gap_get_security_level(p_pairing_complete->Connection_Handle,
                                             &security_mode, &security_level);
            if (ret == BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("     - Security Mode: %u\n     - Security Level: %u\n",
                          security_mode, security_level);
            }
            else
            {
              APP_DBG_MSG("     - aci_gap_get_security_level failed: 0x%02X\n", ret);
            }
          }
          APP_DBG_MSG("\n");

          /* USER CODE BEGIN ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/

          /* USER CODE END ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE*/
        }
        break;
      case ACI_GATT_SRV_READ_VSEVT_CODE :
        {
          APP_DBG_MSG(">>== ACI_GATT_SRV_READ_VSEVT_CODE\n");

          aci_gatt_srv_read_event_rp0 *p_read = (aci_gatt_srv_read_event_rp0 *) p_blecore_evt->data;
          uint8_t error_code = BLE_ATT_ERR_INSUFF_AUTHORIZATION;

          APP_DBG_MSG("Handle 0x%04X\n",  p_read->Attribute_Handle);

          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_1*/

          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_1*/

          aci_gatt_srv_resp(p_read->Connection_Handle,
                            p_read->CID,
                            p_read->Attribute_Handle,
                            error_code,
                            0,
                            NULL);

          /* USER CODE BEGIN ACI_GATT_SRV_READ_VSEVT_CODE_2*/

          /* USER CODE END ACI_GATT_SRV_READ_VSEVT_CODE_2*/
          break;
        }
        /* USER CODE BEGIN EVT_VENDOR_1 */

        /* USER CODE END EVT_VENDOR_1 */
      default:
        /* USER CODE BEGIN EVT_VENDOR_DEFAULT */

