melair/ktane/Firmware/STM32/Comms/App/Src/BLE/app_ble.c
        /* USER CODE END EVT_VENDOR_DEFAULT */
        break;
      }
    } /* HCI_VENDOR_EVT_CODE */
    break;

  case HCI_HARDWARE_ERROR_EVT_CODE:
    {
      hci_hardware_error_event_rp0 *p_hci_hardware_error_event = (hci_hardware_error_event_rp0 *) p_event_pckt->data;

      if (p_hci_hardware_error_event->Hardware_Code <= 0x03)
      {
        NVIC_SystemReset();
      }
    }
    break;

    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */

  default:
    /* USER CODE BEGIN ECODE_DEFAULT*/

    /* USER CODE END ECODE_DEFAULT*/
    break;
  }
}

static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Role,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout)
{
  if(Status != 0)
  {
    APP_DBG_MSG("==>> connection_complete_event Fail, Status: 0x%02X\n", Status);
    return;
  }
  /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE_1 */

  /* USER CODE END HCI_EVT_LE_CONN_COMPLETE_1 */
  APP_DBG_MSG(">>== hci_le_connection_complete_event - Connection handle: 0x%04X\n", Connection_Handle);
  APP_DBG_MSG("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
              Peer_Address[5],
              Peer_Address[4],
              Peer_Address[3],
              Peer_Address[2],
              Peer_Address[1],
              Peer_Address[0]);
  APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n",
              INT(Connection_Interval*1.25),
              FRACTIONAL_2DIGITS(Connection_Interval*1.25),
              Peripheral_Latency,
              Supervision_Timeout * 10);

  if (Role == HCI_ROLE_PERIPHERAL)
  {
    advertising_status = APP_BLE_ADV_STOPPED; /* Legacy advertising stops on connection. */
  }
  if ((Role != HCI_ROLE_PERIPHERAL) ||
      (track_peripheral_connection(Connection_Handle, Peer_Address, Peer_Address_Type) == 0U))
  {
    APP_DBG_MSG("Rejecting untracked connection 0x%04X, role %u\n", Connection_Handle, Role);
    tBleStatus status = aci_gap_terminate(Connection_Handle, BLE_ERROR_TERMINATED_REMOTE_USER);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("Untracked connection termination failed: 0x%02X\n", status);
    }
    return;
  }

  if (peripheral_connection_count < MAX_PERIPHERAL_CONNECTIONS)
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
  }

  /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */

  /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
}/* end hci_le_connection_complete_event() */

static uint8_t track_peripheral_connection(uint16_t connection_handle, const uint8_t mac[6], uint8_t address_type)
{
  for (uint8_t index = 0U; index < peripheral_connection_count; index++)
  {
    if (peripheral_connections[index].handle == connection_handle)
    {
      memcpy(peripheral_connections[index].mac, mac, 6U);
      peripheral_connections[index].address_type = address_type;
      return 1U;
    }
  }

  if (peripheral_connection_count >= MAX_PERIPHERAL_CONNECTIONS)
  {
    return 0U;
  }

  peripheral_connections[peripheral_connection_count].handle = connection_handle;
  memcpy(peripheral_connections[peripheral_connection_count].mac, mac, 6U);
  peripheral_connections[peripheral_connection_count].address_type = address_type;
  peripheral_connections[peripheral_connection_count].status = APP_BLE_CONNECTED;
  peripheral_connection_count++;
  return 1U;
}

static uint8_t untrack_peripheral_connection(uint16_t connection_handle)
{
  for (uint8_t index = 0U; index < peripheral_connection_count; index++)
  {
    if (peripheral_connections[index].handle == connection_handle)
    {
      peripheral_connection_count--;
      peripheral_connections[index] = peripheral_connections[peripheral_connection_count];
      memset(&peripheral_connections[peripheral_connection_count], 0,
             sizeof(peripheral_connections[0]));
      return 1U;
    }
  }

  return 0U;
}

/* USER CODE BEGIN EVT_VENDOR_3 */

/* USER CODE END EVT_VENDOR_3 */

static APP_BLE_Connection_t *find_connection(uint16_t handle)
{
  for (uint8_t index = 0U; index < peripheral_connection_count; index++)
  {
    if (peripheral_connections[index].handle == handle)
    {
      return &peripheral_connections[index];
    }
  }
  return NULL;
}

uint8_t APP_BLE_GetConnectionCount(void)
{
  return peripheral_connection_count;
}

tBleStatus APP_BLE_GetConnection(uint16_t handle, APP_BLE_Connection_t *out)
{
  if (out == NULL)
  {
    return BLE_STATUS_INVALID_PARAMS;
  }
  const APP_BLE_Connection_t *connection = find_connection(handle);
  if (connection == NULL)
  {
    return BLE_STATUS_UNKNOWN_CONNECTION_ID;
  }
  *out = *connection;
  return BLE_STATUS_SUCCESS;
}

tBleStatus APP_BLE_GetConnectionByIndex(uint8_t index, APP_BLE_Connection_t *out)
{
  if ((out == NULL) || (index >= peripheral_connection_count))
  {
    return BLE_STATUS_INVALID_PARAMS;
  }
  *out = peripheral_connections[index];
  return BLE_STATUS_SUCCESS;
}

APP_BLE_AdvertisingStatus_t APP_BLE_GetAdvertisingStatus(void)
{
  return advertising_status;
}

tBleStatus APP_BLE_SetPairingPin(const uint8_t mac[6], uint32_t pin)
{
  uint8_t available = PAIRING_PIN_CAPACITY;

  if ((mac == NULL) || (pin > 999999U) ||
      (memcmp(mac, empty_pairing_mac, 6U) == 0))
  {
    return BLE_STATUS_INVALID_PARAMS;
  }

  for (uint8_t index = 0U; index < PAIRING_PIN_CAPACITY; index++)
  {
    if (memcmp(pairing_pins[index].mac, mac, 6U) == 0)
    {
      pairing_pins[index].pin = pin;
      return BLE_STATUS_SUCCESS;
    }
    if ((available == PAIRING_PIN_CAPACITY) &&
        (memcmp(pairing_pins[index].mac, empty_pairing_mac, 6U) == 0))
    {
      available = index;
    }
  }

  if (available == PAIRING_PIN_CAPACITY)
  {
    return BLE_STATUS_INSUFFICIENT_RESOURCES;
  }
  memcpy(pairing_pins[available].mac, mac, 6U);
  pairing_pins[available].pin = pin;
  return BLE_STATUS_SUCCESS;
}

