melair/ktane/Firmware/STM32/Comms/App/Src/BLE/app_ble.c
static tBleStatus select_pairing_pin(uint16_t connection_handle, uint32_t *pin)
{
  const uint8_t *mac = NULL;
  uint8_t configured = 0U;

  for (uint8_t index = 0U; index < peripheral_connection_count; index++)
  {
    if (peripheral_connections[index].handle == connection_handle)
    {
      mac = peripheral_connections[index].mac;
      break;
    }
  }
  if (mac == NULL)
  {
    return BLE_STATUS_UNKNOWN_CONNECTION_ID;
  }

  for (uint8_t index = 0U; index < PAIRING_PIN_CAPACITY; index++)
  {
    if ((memcmp(pairing_pins[index].mac, empty_pairing_mac, 6U) != 0) &&
        (memcmp(pairing_pins[index].mac, mac, 6U) == 0))
    {
      *pin = pairing_pins[index].pin;
      configured = 1U;
      break;
    }
  }

  if (configured == 0U)
  {
    uint8_t random_bytes[8];
    uint32_t random_value;
    do
    {
      tBleStatus status = hci_le_rand(random_bytes);
      if (status != BLE_STATUS_SUCCESS)
      {
        return status;
      }
      memcpy(&random_value, random_bytes, sizeof(random_value));
      /* Reject the partial top interval before reducing to six decimal digits. */
    } while (random_value >= 4294000000UL);
    *pin = random_value % 1000000U;
    /* TODO: Forward this PIN, peer MAC and connection handle for display. */
  }

  APP_DBG_MSG("Pairing PIN %06lu (%s), peer %02X:%02X:%02X:%02X:%02X:%02X, handle 0x%04X\n",
              (unsigned long)*pin, configured ? "configured" : "random",
              mac[5], mac[4], mac[3], mac[2], mac[1], mac[0], connection_handle);
  return BLE_STATUS_SUCCESS;
}

void APP_BLE_SetPairingMode(uint8_t enabled)
{
  APP_BLE_AdvertisingStatus_t previous_advertising_status = advertising_status;

  enabled = (enabled != 0U) ? 1U : 0U;
  if (pairing_mode_enabled != enabled)
  {
    for (uint8_t index = 0U; index < PAIRING_PIN_CAPACITY; index++)
    {
      memcpy(pairing_pins[index].mac, empty_pairing_mac, 6U);
      pairing_pins[index].pin = 0U;
    }
  }
  pairing_mode_enabled = (enabled != 0U) ? 1U : 0U;

  if ((advertising_status == APP_BLE_ADV_FAST) || (advertising_status == APP_BLE_ADV_LP))
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
    if (advertising_status != APP_BLE_ADV_STOPPED)
    {
      return;
    }
    APP_BLE_Procedure_Gap_Peripheral((previous_advertising_status == APP_BLE_ADV_FAST) ?
                                     PROC_GAP_PERIPH_ADVERTISE_START_FAST :
                                     PROC_GAP_PERIPH_ADVERTISE_START_LP);
  }
}

tBleStatus APP_BLE_ClearPairingInformation(void)
{
  APP_BLE_AdvertisingStatus_t previous_advertising_status = advertising_status;

  /* Connected peers retain their authenticated link after a database erase. */
  if (peripheral_connection_count != 0U)
  {
    return BLE_STATUS_BUSY;
  }

  if ((advertising_status == APP_BLE_ADV_FAST) || (advertising_status == APP_BLE_ADV_LP))
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
    if (advertising_status != APP_BLE_ADV_STOPPED)
    {
      return BLE_STATUS_BUSY;
    }
  }

  tBleStatus status = aci_gap_clear_security_db();
  if (status == BLE_STATUS_SUCCESS)
  {
    /* The security database command does not clear these controller lists. */
    status = refresh_bonded_device_lists();
  }

  if ((previous_advertising_status == APP_BLE_ADV_FAST) ||
      (previous_advertising_status == APP_BLE_ADV_LP))
  {
    APP_BLE_Procedure_Gap_Peripheral((previous_advertising_status == APP_BLE_ADV_FAST) ?
                                     PROC_GAP_PERIPH_ADVERTISE_START_FAST :
                                     PROC_GAP_PERIPH_ADVERTISE_START_LP);
  }

  return status;
}

/* Call only while advertising is stopped. The resolving list maps a peer's
 * private address to the bonded identity used by the filter accept list. */
static tBleStatus refresh_bonded_device_lists(void)
{
  tBleStatus status = hci_le_set_address_resolution_enable(DISABLE);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Disable address resolution failed: 0x%02X\n", status);
    return status;
  }

  status = aci_gap_configure_filter_accept_and_resolving_list(0x03U);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Load bonded accept/resolving lists failed: 0x%02X\n", status);
    return status;
  }

  status = hci_le_set_address_resolution_enable(ENABLE);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Enable address resolution failed: 0x%02X\n", status);
    return status;
  }

  APP_DBG_MSG("Bonded accept/resolving lists loaded; peer address resolution enabled\n");
  Bonded_Device_Entry_t first_bond;
  uint8_t bond_count = 0U;
  status = aci_gap_get_bonded_devices(0U, 1U, &bond_count, &first_bond);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Read stored bonds failed: 0x%02X\n", status);
  }
  else if (bond_count == 0U)
  {
    APP_DBG_MSG("No stored bonds: locked advertising cannot accept any peers\n");
  }
  return BLE_STATUS_SUCCESS;
}

static tBleStatus validate_connection_request(uint16_t handle)
{
  const APP_BLE_Connection_t *connection = find_connection(handle);
  if (connection == NULL)
  {
    return BLE_STATUS_UNKNOWN_CONNECTION_ID;
  }
  return (connection->status == APP_BLE_DISCONNECTING) ? BLE_STATUS_BUSY : BLE_STATUS_SUCCESS;
}

tBleStatus APP_BLE_Disconnect(uint16_t handle)
{
  tBleStatus status = validate_connection_request(handle);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }
  status = aci_gap_terminate(handle, BLE_ERROR_TERMINATED_REMOTE_USER);
  if (status == BLE_STATUS_SUCCESS)
  {
    find_connection(handle)->status = APP_BLE_DISCONNECTING;
  }
  return status;
}

tBleStatus APP_BLE_TogglePhy(uint16_t handle)
{
  tBleStatus status = validate_connection_request(handle);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }
#if (CFG_BLE_CONTROLLER_2M_CODED_PHY_ENABLED == 1)
  uint8_t phy_tx, phy_rx;
  status = hci_le_read_phy(handle, &phy_tx, &phy_rx);
  if (status != BLE_STATUS_SUCCESS)
  {
    return status;
  }
  if ((phy_tx == HCI_TX_PHY_LE_2M) && (phy_rx == HCI_RX_PHY_LE_2M))
  {
    return hci_le_set_phy(handle, 0, HCI_TX_PHYS_LE_1M_PREF, HCI_RX_PHYS_LE_1M_PREF, 0);
  }
  return hci_le_set_phy(handle, 0, HCI_TX_PHYS_LE_2M_PREF, HCI_RX_PHYS_LE_2M_PREF, 0);
#else
  return BLE_ERROR_UNSUPPORTED_FEATURE;
#endif
}

tBleStatus APP_BLE_ExchangeMtu(uint16_t handle)
{
  tBleStatus status = validate_connection_request(handle);
  return (status == BLE_STATUS_SUCCESS) ? aci_gatt_clt_exchange_config(handle) : status;
}

