melair/ktane/Firmware/STM32/Comms/App/Src/BLE/app_ble.c
tBleStatus APP_BLE_RequestConnectionParameterUpdate(uint16_t handle)
{
  tBleStatus status = validate_connection_request(handle);
  return (status == BLE_STATUS_SUCCESS) ?
    aci_l2cap_connection_parameter_update_req(handle, CONN_INT_MS(1000),
                                             CONN_INT_MS(1000), 0U, 0x01F4U) : status;
}

void APP_BLE_Procedure_Gap_Peripheral(ProcGapPeripheralId_t ProcGapPeripheralId)
{
  tBleStatus status;
  uint32_t paramA = ADV_INTERVAL_MIN;
  uint32_t paramB = ADV_INTERVAL_MAX;
  APP_BLE_AdvertisingStatus_t requested_status = APP_BLE_ADV_STOPPED;

  /* First set parameters before calling ACI APIs, only if needed */
  switch(ProcGapPeripheralId)
  {
    case PROC_GAP_PERIPH_ADVERTISE_START_FAST:
    {
      paramA = ADV_INTERVAL_MIN;
      paramB = ADV_INTERVAL_MAX;
      requested_status = APP_BLE_ADV_FAST;

      /* USER CODE BEGIN PROC_GAP_PERIPH_ADVERTISE_START_FAST */

      /* USER CODE END PROC_GAP_PERIPH_ADVERTISE_START_FAST */
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_START_FAST */
    case PROC_GAP_PERIPH_ADVERTISE_START_LP:
    {
      paramA = ADV_LP_INTERVAL_MIN;
      paramB = ADV_LP_INTERVAL_MAX;
      requested_status = APP_BLE_ADV_LP;

      /* USER CODE BEGIN PROC_GAP_PERIPH_ADVERTISE_START_LP */

      /* USER CODE END PROC_GAP_PERIPH_ADVERTISE_START_LP */
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_START_LP */
    case PROC_GAP_PERIPH_ADVERTISE_STOP:
    {
      requested_status = APP_BLE_ADV_STOPPED;

      /* USER CODE BEGIN PROC_GAP_PERIPH_ADVERTISE_STOP */

      /* USER CODE END PROC_GAP_PERIPH_ADVERTISE_STOP */
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_STOP */
    /* USER CODE BEGIN GAP_PERIPHERAL_1 */

    /* USER CODE END GAP_PERIPHERAL_1 */
    default:
      break;
  }

  /* Call ACI APIs */
  switch(ProcGapPeripheralId)
  {
    case PROC_GAP_PERIPH_ADVERTISE_START_FAST:
    case PROC_GAP_PERIPH_ADVERTISE_START_LP:
    {

      /* USER CODE BEGIN PROC_GAP_PERIPHERAL_ID */

      /* USER CODE END PROC_GAP_PERIPHERAL_ID */

      if (peripheral_connection_count >= MAX_PERIPHERAL_CONNECTIONS)
      {
        APP_DBG_MSG("Advertising start skipped: connection limit reached\n");
        return;
      }
      if (advertising_status != APP_BLE_ADV_STOPPED)
      {
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
        if (advertising_status != APP_BLE_ADV_STOPPED)
        {
          return;
        }
      }
      Advertising_Set_Parameters_t Advertising_Set_Parameters = {0};

      /* Include bonds created since boot before switching to a filtered policy.
       * Do not enable advertising if list loading or address resolution fails. */
      status = refresh_bonded_device_lists();
      if (status != BLE_STATUS_SUCCESS)
      {
        return;
      }

      /* Start Fast or Low Power Advertising */

      /* Set advertising configuration for legacy advertising */
      status = aci_gap_set_advertising_configuration(0,
                                                     pairing_mode_enabled ? GAP_MODE_GENERAL_DISCOVERABLE :
                                                                            GAP_MODE_NON_DISCOVERABLE,
                                                     ADV_TYPE,
                                                     paramA,
                                                     paramB,
                                                     HCI_ADV_CH_ALL,
                                                     0,
                                                     NULL, /* No peer address */
                                                     pairing_mode_enabled ? HCI_ADV_FILTER_NONE :
                                                                            HCI_ADV_FILTER_ACCEPT_LIST_SCAN_CONNECT,
                                                     0, /* 0 dBm */
                                                     HCI_PHY_LE_1M, /* Primary advertising PHY */
                                                     0, /* 0 skips */
                                                     HCI_PHY_LE_1M, /* Secondary advertising PHY. Not used with legacy advertising. */
                                                     0, /* SID */
                                                     0 /* No scan request notifications */);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_configuration - fail, result: 0x%02X\n", status);
        return;
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_configuration\n");
      }

      /* Discoverable modes require an unfiltered policy. Keep the Flags AD
       * field consistent with non-discoverable, accept-list-only locked mode. */
      a_AdvData[KTANE_ADV_FLAGS_INDEX] = FLAG_BIT_BR_EDR_NOT_SUPPORTED |
        (pairing_mode_enabled ? FLAG_BIT_LE_GENERAL_DISCOVERABLE_MODE : 0U);
      status = aci_gap_set_advertising_data(0, ADV_COMPLETE_DATA, sizeof(a_AdvData), (uint8_t*) a_AdvData);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_data Failed, result: 0x%02X\n", status);
        return;
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_data\n");
      }

      status = aci_gap_set_scan_response_data(0, sizeof(a_ScanResponseData),
                                              a_ScanResponseData);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_scan_response_data Failed, result: 0x%02X\n", status);
        return;
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_scan_response_data\n");
      }

      /* Enable advertising */
      status = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("==>> aci_gap_set_advertising_enable Failed, result: 0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> Success: aci_gap_set_advertising_enable\n");
        advertising_status = requested_status;
      }
      break;
    }
    case PROC_GAP_PERIPH_ADVERTISE_STOP:
    {
      status = aci_gap_set_advertising_enable(DISABLE, 0, NULL);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Disable advertising - fail, result: 0x%02X\n",status);
      }
      else
      {
        APP_DBG_MSG("==>> Disable advertising - Success\n");
        advertising_status = APP_BLE_ADV_STOPPED;
      }
      break;
    }/* PROC_GAP_PERIPH_ADVERTISE_STOP */
    case PROC_GAP_PERIPH_SET_BROADCAST_MODE:
    {

      break;
    }/* PROC_GAP_PERIPH_SET_BROADCAST_MODE */
    /* USER CODE BEGIN GAP_PERIPHERAL_2 */

    /* USER CODE END GAP_PERIPHERAL_2 */
    default:
      break;
  }
}

/* USER CODE BEGIN FD*/

/* USER CODE END FD*/

/* USER CODE BEGIN FD_LOCAL_FUNCTION */

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
